KanatERPSukhova.КанатАдаптация/src/DataProcessors/ПечатьСчетовНаОплату/ПечатьСчетовНаОплату.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="32397654-efcb-4ed3-ae6b-309c4a503ab6">
  <name>ПечатьСчетовНаОплату</name>
  <objectBelonging>Adopted</objectBelonging>
</mdclass:DataProcessor>

KanatERPSukhova.КанатАдаптация/src/Enums/ВариантыПредставленияНаборовВПечатныхФормах/ВариантыПредставленияНаборовВПечатныхФормах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="b79525ad-81e5-4ab3-8c59-e091ffe0a29d">
  <name>ВариантыПредставленияНаборовВПечатныхФормах</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="21b695cb-00f3-400b-b0e7-972bd8e2533f">
    <name>ТолькоНабор</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="0f2a8624-5799-402f-97ba-02cdf4c72be8">
    <name>ТолькоКомплектующие</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="686f485c-ddca-4f46-aef3-d47c949caecc">
    <name>НаборИКомплектующие</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

KanatERPSukhova.КанатАдаптация/src/Enums/ЮрФизЛицо/ЮрФизЛицо.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="e9878089-011c-4608-902f-a358fcc73d96">
  <name>ЮрФизЛицо</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="e3ea3f3b-568c-408a-bb78-fa4a49f84317">
    <name>ФизЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="1312f787-af91-4e9f-bb79-f968d50d327d">
    <name>ЮрЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

KanatERPSukhova.КанатАдаптация/src/Enums/ВариантыОтсчетаДатыПлатежа/ВариантыОтсчетаДатыПлатежа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="5abb70ea-0663-4378-919d-0ea83e97d3dc">
  <name>ВариантыОтсчетаДатыПлатежа</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="b690e4c2-e9a8-40ea-8b8b-fea31617f479">
    <name>ОтДатыОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

KanatERPSukhova.КанатАдаптация/src/Enums/СпособыДоставки/СпособыДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="e84f811f-b8c6-4c9c-9e98-f10ab90f1702">
  <name>СпособыДоставки</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="066e8fb0-3813-4481-b4bf-edfafab4aed9">
    <name>СиламиПеревозчикаПоАдресу</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="f442a653-b32b-4be9-9b5e-4a5abb206d85">
    <name>Самовывоз</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="3c09e30d-ef7d-4e10-9b7e-c3d470857e36">
    <name>ДоКлиента</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="b983ffd7-6fee-4341-823c-bc970e783c64">
    <name>СиламиПеревозчика</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="c07693f6-6c15-46b9-8ea5-6560cf995152">
    <name>КПолучателюОпределяетСлужбаДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

KanatERPSukhova.КанатАдаптация/src/Documents/СчетНаОплатуКлиенту/СчетНаОплатуКлиенту.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="7deae7a3-c5c6-4e3a-8a69-ee8c92e40c9a">
  <name>СчетНаОплатуКлиенту</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="38171f51-f270-4a82-a089-b63c611c4f1e">
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КАНАТ_ФормаОплаты</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КАНАТ_ИспользоватьФормуОплаты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КАНАТ_Товары</name>
    <comment>Задача 000000222</comment>
    <attributes>
      <name>ДатаОтгрузки</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидЦены</name>
      <type>
        <types>CatalogRef.ВидыЦен</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьСтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>13</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентРучнойСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРучнойСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентАвтоматическойСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаАвтоматическойСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаОтмены</name>
      <type>
        <types>CatalogRef.ПричиныОтменыЗаказовКлиентов</types>
      </type>
    </attributes>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отменено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокПоставки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Содержание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусУказанияСерий</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВариантОбеспечения</name>
      <type>
        <types>EnumRef.ВариантыОбеспечения</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураНабора</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Обособленно</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНабора</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВариантОбеспеченияДоИзмененияОбновлениемИБ</name>
      <type>
        <types>EnumRef.ВариантыОбеспечения</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураПартнера</name>
      <type>
        <types>CatalogRef.НоменклатураКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаБонусныхБалловКСписанию</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаБонусныхБалловКСписаниюВВалюте</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНачисленныхБонусныхБалловВВалюте</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СпособДоставки</name>
      <comment>Из объекта ДокументОснование</comment>
      <type>
        <types>EnumRef.СпособыДоставки</types>
      </type>
    </attributes>
    <attributes>
      <name>ПеревозчикПартнер</name>
      <type>
        <types>CatalogRef.Партнеры</types>
      </type>
    </attributes>
    <attributes>
      <name>Грузополучатель</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>НеОтгружатьЧастями</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОтгрузкиОснования</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресДоставки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КАНАТ_ПлатитЗаДоставку</name>
      <type>
        <types>EnumRef.КАНАТ_ПлатитЗаДоставку</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

KanatERPSukhova.КанатАдаптация/src/DataProcessors/ПечатьСчетовНаОплату/ManagerModule.bsl
Процедура ЗаполнитьТабличныйДокументСчетаНаОплату_СчетНаОплатуКлиенту(ТабличныйДокумент, ДанныеДляПечати, ОбъектыПечати, ПараметрыПечати)
		
	ШаблоныОшибок = Новый Структура;
	ШаблоныОшибок.Вставить("Товары", НСтр("ru = 'В документе %1 отсутствуют товары. Печать счета на оплату не требуется';
											|en = 'Goods are missing in the %1 document. It is not required to print the commercial invoice'"));
	ШаблоныОшибок.Вставить("ЗаменяющиеТовары", НСтр("ru = 'В документе %1 отсутствуют заменяющие товары. Печать счета на оплату не требуется';
													|en = 'Substitute goods are missing in the %1 document. It is not required to print the commercial invoice'"));
	ШаблоныОшибок.Вставить("Этапы", НСтр("ru = 'В документе %1 отсутствуют этапы оплаты. Печать счета на оплату не требуется';
										|en = 'Payment steps are missing in the %1 document. It is not required to print the commercial invoice'"));
	
	ИспользуетсяУчетНДС = ПолучитьФункциональнуюОпцию("ИспользоватьУчетНДС");
	ИспользоватьРучныеСкидки         = ПолучитьФункциональнуюОпцию("ИспользоватьРучныеСкидкиВПродажах");
	ИспользоватьАвтоматическиеСкидки = ПолучитьФункциональнуюОпцию("ИспользоватьАвтоматическиеСкидкиВПродажах");
	
	КолонкаКодов = ФормированиеПечатныхФорм.ДополнительнаяКолонкаПечатныхФормДокументов();
	ИмяКолонкиКодов = КолонкаКодов.ИмяКолонки;
	ПредставлениеКолонкиКодов = КолонкаКодов.ПредставлениеКолонки;
	
	СтруктураИмяДопКолонки = Новый Структура("ИмяКолонкиКодов, ПредставлениеКолонкиКодов", ИмяКолонкиКодов, ПредставлениеКолонкиКодов);
	
	ДанныеПечати = ДанныеДляПечати.РезультатПоШапке.Выбрать();
	ЭтапыОплаты = ДанныеДляПечати.РезультатПоЭтапамОплаты.Выгрузить();
	
	// <+БИТ> Руденков_Е.И. 29.03.2024 
	// #000000222, Счет на оплату.
	КАНАТ_Товары = ДанныеДляПечати.КАНАТ_Товары.Выгрузить();
	//БИТ_Гурьев__02.05.24++
	КАНАТ_Товары.Свернуть("АдресДоставки,
						  |ВариантОбеспечения,
						  |ВариантОбеспеченияДоИзмененияОбновлениемИБ,
						  //БИТ_Гурьев_мелкие замечания_22.05.24++
						  //|ВидЦены,
						  //БИТ_Гурьев_мелкие замечания_22.05.24--
						  |Грузополучатель,
						  |ДатаОтгрузки,
						  |ДатаОтгрузкиОснования,
						  |КАНАТ_ПлатитЗаДоставку,
						  |НаименованиеПолное,
						  |НеОтгружатьЧастями,
						  |Номенклатура,
						  |НоменклатураНабора,
						  |НоменклатураПартнера,
						  |Обособленно,
						  |Отменено,
						  |ПеревозчикПартнер,
						  |Подразделение,
						  |ПроцентАвтоматическойСкидки,
						  |ПроцентРучнойСкидки,
						  //БИТ_Гурьев_мелкие замечания_22.05.24++
						  //|Серия,
						  //БИТ_Гурьев_мелкие замечания_22.05.24--
						  |Склад,
						  |Содержание,
						  |СпособДоставки,
						  |СрокПоставки,
						  |Ссылка,
						  |СтавкаНДС,
						  |СтатусУказанияСерий,
						  |Упаковка,
						  //БИТ_Гурьев_мелкие замечания_22.05.24++
						  //|Характеристика,
						  //|ХарактеристикаНабора,
						  //|ХарактеристикаНабораНаименованиеПолное,
						  //БИТ_Гурьев_мелкие замечания_22.05.24--
						  |Цена,
						  |ЦенаТЧ,
						  |ЭтоВозвратнаяТара,
						  |ЭтоКомплектующие,
						  |ЭтоНабор,
						  |Отменено,
						  |ПричинаОтмены,
						  |ЕдиницаИзмерения",
						  "Сумма,
						  |СуммаАвтоматическойСкидки,
						  |СуммаБезСкидки,
						  |СуммаБонусныхБалловКСписанию,
						  |СуммаБонусныхБалловКСписаниюВВалюте,
						  |СуммаНДС,
						  |СуммаНачисленныхБонусныхБалловВВалюте,
						  |СуммаРучнойСкидки,
						  |СуммаСНДС,
						  |СуммаСкидки,
						  |Количество,
						  |КоличествоУпаковок");
	//БИТ_Гурьев__02.05.24--
	// <-БИТ> Руденков_Е.И. 29.03.2024
	Товары = ДанныеДляПечати.РезультатПоТабличнойЧасти.Выгрузить();
	//·++·Гурьев·07.08.23·#2_11_4·Данные табличной части, нужные для заполнения полей
    Товары.Свернуть("Артикул,
					|ВариантПредставленияНабораВПечатныхФормах,
					|ВариантРасчетаЦеныНабора,
					//БИТ_Гурьев_мелкие замечания_22.05.24++
					//|ВидЦеныИсполнителя,
					//БИТ_Гурьев_мелкие замечания_22.05.24--
					|ЕдиницаИзмерения,
					|Код,
					|НаименованиеПолное,
					|Номенклатура,
					|НоменклатураНабора,
					|НоменклатураНабораНаименованиеПолное,
					|Содержание,
					|Ссылка,
					|СтавкаНДС,
					|Упаковка,
					//БИТ_Гурьев_мелкие замечания_22.05.24++
					//|Характеристика,
					//|ХарактеристикаНабора,
					//|ХарактеристикаНабораНаименованиеПолное,
					//БИТ_Гурьев_мелкие замечания_22.05.24--
					|Цена,
					|ЭтоВозвратнаяТара,
					|ЭтоКомплектующие,
					|ЭтоНабор",
					"Количество,
					|Сумма,
					|СуммаБезСкидки,
					|СуммаНДС,
					|СуммаСкидки");
	//БИТ_Гурьев__02.05.24--
	ЭтапыГрафикаОплатыЗаказКлиента = ДанныеДляПечати.ЭтапыГрафикаОплатыЗаказКлиента.Выгрузить();
	//·--·Гурьев·07.08.23
	//·++·Гурьев·16.08.23·#2_2·Данные по документу удостоверяющему личность
	ДанныеДокументУдостоверяющийЛичность = ДанныеДляПечати.ДокументУдостоверяющийЛичность.Выгрузить();
	 
	//·--·Гурьев·16.08.23


	
	ЭтапыЗалоговойТары = ЭтапыОплаты.НайтиСтроки(Новый Структура("ЭтоЗалогЗаТару", Истина));
	ТолькоЗалогЗаТару = ЭтапыЗалоговойТары.Количество() = ЭтапыОплаты.Количество() И ЭтапыЗалоговойТары.Количество() > 0;
	
	Если Товары.Колонки.Найти("Содержание")=Неопределено Тогда
		ЕстьСодержание = Ложь;
	Иначе
		ЕстьСодержание = Истина;
	КонецЕсли;
	
	ПоказыватьНДС = Константы.ВыводитьДопКолонкиНДС.Получить();
	ПервыйДокумент = Истина;
	
	Пока ДанныеПечати.Следующий() Цикл
		
		Отказ = Ложь;
		
		СтруктураПоиска = Новый Структура("Ссылка", ДанныеПечати.Ссылка);
		
		ИспользоватьНаборы = Ложь;
		Если Товары.Колонки.Найти("ЭтоНабор") <> Неопределено Тогда
			ИспользоватьНаборы = Истина;
		КонецЕсли;
		
		// <+БИТ> Руденков_Е.И. 29.03.2024 
		// #000000222, Счет на оплату. 
		//ТаблицаТовары = Товары.НайтиСтроки(СтруктураПоиска);
		Если КАНАТ_Товары.Количество() > 0 Тогда
			//Значит в счете на оплату сохранен список товаров, берем их оттуда, а не из документа-основания
			ТаблицаТовары = КАНАТ_Товары.НайтиСтроки(СтруктураПоиска);
		Иначе
			ТаблицаТовары = Товары.НайтиСтроки(СтруктураПоиска);
		КонецЕсли;
		// <-БИТ> Руденков_Е.И. 29.03.2024
		ТаблицаЭтапыОплаты = ЭтапыОплаты.НайтиСтроки(СтруктураПоиска);
		//·++·Гурьев·07.08.23·#2_11_4·Данные табличной части, нужные для заполнения полей
		ТаблицаЭтапыГрафикаОплатыЗаказКлиента = ЭтапыГрафикаОплатыЗаказКлиента.НайтиСтроки(СтруктураПоиска);
		//·--·Гурьев·07.08.23
		//·++·Гурьев·16.08.23·#2_2·Данные по документу удостоверяющему личность
		ТаблицаДанныеДокументУдостоверяющийЛичность = ДанныеДокументУдостоверяющийЛичность.НайтиСтроки(СтруктураПоиска);
		//·--·Гурьев·16.08.23
		
		ПроверкаЗаполненияДокумента(ДанныеПечати, ТаблицаТовары, ТаблицаЭтапыОплаты, ШаблоныОшибок, Отказ, Истина);
		Если Отказ Тогда
			Продолжить;
		КонецЕсли;
		
		Если ПервыйДокумент Тогда
			ПервыйДокумент = Ложь;
		Иначе
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ЗаголовокСкидки = ФормированиеПечатныхФорм.НужноВыводитьСкидки(ТаблицаТовары, ИспользоватьРучныеСкидки Или ИспользоватьАвтоматическиеСкидки);
		ЕстьСкидки = ЗаголовокСкидки.ЕстьСкидки;
		
		НазванияОбластей = НазванияОбластей(ДанныеПечати.УчитыватьНДС И НЕ ТолькоЗалогЗаТару И ПоказыватьНДС, ЕстьСкидки);
		
		Макет = Новый ТабличныйДокумент;
		ЗаполнитьРеквизитыШапкиСчетаНаОплату_СчетНаОплатуКлиенту(ДанныеПечати, Макет, ТабличныйДокумент, ТаблицаЭтапыОплаты, ТаблицаТовары,
																	ТаблицаЭтапыГрафикаОплатыЗаказКлиента, ТаблицаДанныеДокументУдостоверяющийЛичность);
		
		Если ДанныеПечати.ЧастичнаяОплата ИЛИ ТипЗнч(ДанныеПечати.ДокументОснование) = Тип("ДокументСсылка.ОтчетКомитенту") Тогда
			
			ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицыЧастичнаяОплата");
			ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);
			
			ОбластьСтрокаТаблицы = Макет.ПолучитьОбласть("СтрокаТаблицыЧастичнаяОплата");
			ОбластьСтрокаТаблицы.Параметры.Заполнить(ДанныеПечати);
			ОбластьСтрокаТаблицы.Параметры.НомерСтроки = 1;
			ТабличныйДокумент.Вывести(ОбластьСтрокаТаблицы);
			
			ОбластьИтого = Макет.ПолучитьОбласть("ПодвалТаблицыЧастичнаяОплата");
			СтруктураДанныхИтого = Новый Структура;
			СтруктураДанныхИтого.Вставить("Всего", ДанныеПечати.СуммаДокумента);
			ОбластьИтого.Параметры.Заполнить(СтруктураДанныхИтого);
			ОбластьИтого.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Присоединить(ОбластьИтого);
			
			// Вывести ИтогоНДС
			СоответствиеСтавокНДС = Новый Соответствие;
			Если ДанныеПечати.УчитыватьНДС И НЕ ТолькоЗалогЗаТару 
				И НЕ ДанныеПечати.ОперацияОблагаетсяНДСУПокупателя Тогда
				ОбластьИтогоНДС = Макет.ПолучитьОбласть("ПодвалТаблицыНДС");
				
				Если ТаблицаТовары.Количество() = 0 Тогда
					Если ЗначениеЗаполнено(ДанныеПечати.СтавкаНДС) Тогда
						СуммаНДС = ДанныеПечати.СуммаНДС;
						СоответствиеСтавокНДС.Вставить(ДанныеПечати.СтавкаНДС, СуммаНДС);
					КонецЕсли;
				Иначе
					Для Каждого СтрокаТовара Из ТаблицаТовары Цикл
						Если ИспользоватьНаборы И СтрокаТовара.ЭтоНабор
							И Не (СтрокаТовара.ВариантПредставленияНабораВПечатныхФормах = 
								Перечисления.ВариантыПредставленияНаборовВПечатныхФормах.ТолькоНабор) Тогда
							// Исключаем суммы НДС по набору в целом, когда комплектующие выводятся в печатных формах.
							Продолжить;
						КонецЕсли;
						СуммаНДС = СоответствиеСтавокНДС[СтрокаТовара.СтавкаНДС];
						Если СуммаНДС = Неопределено Тогда
							СуммаНДС = СтрокаТовара.СуммаНДС;
						Иначе
							СуммаНДС = СуммаНДС + СтрокаТовара.СуммаНДС;
						КонецЕсли;
						СоответствиеСтавокНДС.Вставить(СтрокаТовара.СтавкаНДС, СуммаНДС);
					КонецЦикла;
				КонецЕсли;
				Если СоответствиеСтавокНДС.Количество() > 0 Тогда
					Для Каждого ТекСтавкаНДС Из СоответствиеСтавокНДС Цикл
						СтруктураДанныхИтогоНДС = Новый Структура;
						СтруктураДанныхИтогоНДС.Вставить("НДС", ФормированиеПечатныхФорм.ТекстНДСПоСтавке(ТекСтавкаНДС.Ключ, ДанныеПечати.ЦенаВключаетНДС));
						Если ЗначениеЗаполнено(ТекСтавкаНДС.Значение) Тогда
							СтруктураДанныхИтогоНДС.Вставить("ВсегоНДС", ФормированиеПечатныхФорм.ФорматСумм(ТекСтавкаНДС.Значение /100 * ДанныеПечати.ПроцентОплаты));
						Иначе
							СтруктураДанныхИтогоНДС.Вставить("ВсегоНДС","-");
						КонецЕсли;
						ОбластьИтогоНДС.Параметры.Заполнить(СтруктураДанныхИтогоНДС);
						ТабличныйДокумент.Вывести(ОбластьИтогоНДС);
					КонецЦикла;
					ОбластьПодвалСНДС = Макет.ПолучитьОбласть("ПодвалТаблицыВсего");
					СтруктураДанныхПодвалСНДС = Новый Структура("ВсегоСНДС", ФормированиеПечатныхФорм.ФорматСумм(ДанныеПечати.СуммаДокумента));
					ОбластьПодвалСНДС.Параметры.Заполнить(СтруктураДанныхПодвалСНДС);
					ТабличныйДокумент.Вывести(ОбластьПодвалСНДС);
				КонецЕсли;
			ИначеЕсли ИспользуетсяУчетНДС Тогда
				СтруктураДанныхПодвалНДС = Новый Структура;
				Если ДанныеПечати.ОперацияОблагаетсяНДСУПокупателя Тогда
					СтруктураДанныхПодвалНДС.Вставить("НДС", НСтр("ru = 'НДС исчисляется налоговым агентом';
																	|en = 'VAT is calculated by tax agent'", ОбщегоНазначения.КодОсновногоЯзыка()));
				Иначе
					СтруктураДанныхПодвалНДС.Вставить("НДС", НСтр("ru = 'Без налога (НДС)';
																	|en = 'Without tax (VAT)'", ОбщегоНазначения.КодОсновногоЯзыка()));
				КонецЕсли;
				ОбластьПодвалНДС             = Макет.ПолучитьОбласть("ПодвалТаблицыНДС");
				СтруктураДанныхПодвалНДС.Вставить("ВсегоНДС", "-");
				ОбластьПодвалНДС.Параметры.Заполнить(СтруктураДанныхПодвалНДС);
				ТабличныйДокумент.Вывести(ОбластьПодвалНДС);
			КонецЕсли;
			
			// Вывести Сумму прописью
			ОбластьМакета = Макет.ПолучитьОбласть("СуммаПрописьюЧастичныйСчет");
			СуммаПрописью = НСтр("ru = 'Всего на сумму %СуммаПрописью%';
								|en = 'Total in the amount of %СуммаПрописью%'", ОбщегоНазначения.КодОсновногоЯзыка());
			СуммаПрописью = СтрЗаменить(СуммаПрописью, "%СуммаПрописью%", РаботаСКурсамиВалютУТ.СформироватьСуммуПрописью(ДанныеПечати.СуммаДокумента, ДанныеПечати.Валюта));
			СтруктураДанныхСуммаПрописью = Новый Структура("СуммаПрописью", СуммаПрописью);
			ОбластьМакета.Параметры.Заполнить(СтруктураДанныхСуммаПрописью);
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
		Иначе
		
			// Таблица "Товары"
			ОбластьШапкаТаблицы          = Макет.ПолучитьОбласть(НазванияОбластей.ШапкаТаблицы);
			ОбластьСтрокаТаблицыСтандарт = Макет.ПолучитьОбласть(НазванияОбластей.СтрокаТаблицы);
			ОбластьПодвалТаблицы         = Макет.ПолучитьОбласть(НазванияОбластей.ПодвалТаблицы);
			ОбластьПодвалНДС             = Макет.ПолучитьОбласть("ПодвалТаблицыНДС");
			
			Если ИспользоватьНаборы Тогда
				ОбластьСтрокаТаблицыНабор         = Макет.ПолучитьОбласть(НазванияОбластей.СтрокаТаблицыНабор);
				ОбластьСтрокаТаблицыКомплектующие = Макет.ПолучитьОбласть(НазванияОбластей.СтрокаТаблицыКомплектующие);
			КонецЕсли;
			
			ПустыеДанные = НаборыСервер.ПустыеДанные();
			ВыводШапки = 0;
			
			Если ДанныеПечати.УчитыватьНДС И НЕ ТолькоЗалогЗаТару Тогда
				Если ЕстьСкидки Тогда
					ОбластьПодвалСНДС = Макет.ПолучитьОбласть("ПодвалТаблицыВсегоСНДССоСкидкой");
				Иначе
					ОбластьПодвалСНДС = Макет.ПолучитьОбласть("ПодвалТаблицыВсегоСНДС");
				КонецЕсли
			КонецЕсли;
			
			Если ЕстьСкидки Тогда
				СтруктураЗаголовокСкидки = Новый Структура("Скидка, СуммаБезСкидки", 
					ЗаголовокСкидки.Скидка,
					ЗаголовокСкидки.СуммаСкидки);
				ОбластьШапкаТаблицы.Параметры.Заполнить(СтруктураЗаголовокСкидки);
			КонецЕсли; 
			ОбластьШапкаТаблицы.Параметры.Заполнить(СтруктураИмяДопКолонки);
			ОбластьСуммаПрописью = Макет.ПолучитьОбласть(?(ДанныеПечати.СчетКВозврату, "СуммаПрописьюКВозврату", "СуммаПрописью"));
			
			МассивПроверкиВывода = Новый Массив;
			
			Сумма = 0;
			СуммаНДС = 0;
			ВсегоСкидок = 0;
			ВсегоБезСкидок = 0;
			НомерСтроки = 0;
			СоответствиеСтавокНДС = Новый Соответствие;
			Для Каждого СтрокаТовары Из ТаблицаТовары Цикл
				
				Если НаборыСервер.ИспользоватьОбластьНабор(СтрокаТовары, ИспользоватьНаборы) Тогда
					ОбластьСтрокаТаблицы = ОбластьСтрокаТаблицыНабор;
				ИначеЕсли НаборыСервер.ИспользоватьОбластьКомплектующие(СтрокаТовары, ИспользоватьНаборы) Тогда
					ОбластьСтрокаТаблицы = ОбластьСтрокаТаблицыКомплектующие;
				Иначе
					ОбластьСтрокаТаблицы = ОбластьСтрокаТаблицыСтандарт;
				КонецЕсли;
				
				Если НаборыСервер.ВыводитьТолькоЗаголовок(СтрокаТовары, ИспользоватьНаборы) Тогда
					НомерСтрокиПечать = "";
				Иначе
					НомерСтроки = НомерСтроки + 1;
					НомерСтрокиПечать = НомерСтроки;
				КонецЕсли;
				
				Если НомерСтроки = 0 И ВыводШапки <> 2 Тогда
					ВыводШапки = 1;
				КонецЕсли;
				
				ПрефиксИПостфикс = НаборыСервер.ПолучитьПрефиксИПостфикс(СтрокаТовары, ИспользоватьНаборы);
				
				ДополнительныеПараметрыПолученияНаименованияДляПечати = НоменклатураКлиентСервер.ДополнительныеПараметрыПредставлениеНоменклатурыДляПечати();
				ДополнительныеПараметрыПолученияНаименованияДляПечати.ВозвратнаяТара = СтрокаТовары.ЭтоВозвратнаяТара;
				ДополнительныеПараметрыПолученияНаименованияДляПечати.КодОсновногоЯзыка = ОбщегоНазначения.КодОсновногоЯзыка();
				Если ЕстьСодержание Тогда
					ДополнительныеПараметрыПолученияНаименованияДляПечати.Содержание = СтрокаТовары.Содержание;
				КонецЕсли;
				
				// <+БИТ> Руденков_Е.И. 10.04.2024 
				// #000000222, Счет на оплату
				//Товар = ПрефиксИПостфикс.Префикс
				//		+ НоменклатураКлиентСервер.ПредставлениеНоменклатурыДляПечати(
				//											СтрокаТовары.НаименованиеПолное,
				//											СтрокаТовары.Характеристика,
				//											,
				//											, // Серия
				//											ДополнительныеПараметрыПолученияНаименованияДляПечати)
				//		+ ПрефиксИПостфикс.Постфикс;
				Если Истина Тогда//Не исключаю, что в будущем может понадобиться условие вывода характеристики, но пока её просто убираем
					Товар = ПрефиксИПостфикс.Префикс
							+ НоменклатураКлиентСервер.ПредставлениеНоменклатурыДляПечати(
																СтрокаТовары.НаименованиеПолное,
																,
																,
																, // Серия
																ДополнительныеПараметрыПолученияНаименованияДляПечати)
							+ ПрефиксИПостфикс.Постфикс;
				Иначе
					Товар = ПрефиксИПостфикс.Префикс
							+ НоменклатураКлиентСервер.ПредставлениеНоменклатурыДляПечати(
																СтрокаТовары.НаименованиеПолное,
																СтрокаТовары.Характеристика,
																,
																, // Серия
																ДополнительныеПараметрыПолученияНаименованияДляПечати)
							+ ПрефиксИПостфикс.Постфикс;				КонецЕсли;
				// <-БИТ> Руденков_Е.И. 10.04.2024
						
				СтруктураДанныхСтроки = Новый Структура;
				СтруктураДанныхСтроки.Вставить("Товар", Товар);
				СтруктураДанныхСтроки.Вставить("НомерСтроки", НомерСтрокиПечать);
				ОбластьСтрокаТаблицы.Параметры.Заполнить(СтрокаТовары);
				// <+БИТ> Руденков_Е.И. 01.03.2024 
				// #000000174, Ошибка в ПФ счета
				Если СтрокаТовары.СуммаНДС > 0 Тогда
					ОбластьСтрокаТаблицы.Параметры.Сумма = СтрокаТовары.Сумма + СтрокаТовары.СуммаНДС;
				КонецЕсли;
				// <-БИТ> Руденков_Е.И. 01.03.2024
				Если ЗаголовокСкидки.ЕстьСкидки Тогда
					СтруктураДанныхСтроки.Вставить("СуммаСкидки",
						?(ЗаголовокСкидки.ТолькоНаценка,- СтрокаТовары.СуммаСкидки,СтрокаТовары.СуммаСкидки));
				КонецЕсли;
				
				Если ЗначениеЗаполнено(СтруктураИмяДопКолонки.ИмяКолонкиКодов) Тогда
					СтруктураДанныхСтроки.Вставить("Артикул", СтрокаТовары[СтруктураИмяДопКолонки.ИмяКолонкиКодов]);
				КонецЕсли;
				
				Если ДанныеПечати.ОперацияОблагаетсяНДСУПокупателя Тогда
					СтруктураДанныхСтроки.Вставить("СтавкаНДС", НСтр("ru = 'НДС исчисляется налоговым агентом';
																	|en = 'VAT is calculated by tax agent'", ОбщегоНазначения.КодОсновногоЯзыка()));
				КонецЕсли;
				
				ОбластьСтрокаТаблицы.Параметры.Заполнить(СтруктураДанныхСтроки);
				
				Если НаборыСервер.ВыводитьТолькоЗаголовок(СтрокаТовары, ИспользоватьНаборы) Тогда
					ОбластьСтрокаТаблицы.Параметры.Заполнить(ПустыеДанные);
				КонецЕсли;
				
				МассивПроверкиВывода.Очистить();
				МассивПроверкиВывода.Добавить(ОбластьСтрокаТаблицы);
				Если НомерСтроки = ТаблицаТовары.Количество() Тогда
					МассивПроверкиВывода.Добавить(ОбластьПодвалТаблицы);
					МассивПроверкиВывода.Добавить(ОбластьПодвалНДС);
					МассивПроверкиВывода.Добавить(ОбластьСуммаПрописью);
				КонецЕсли;
				
				Если ТабличныйДокумент.ПроверитьВывод(МассивПроверкиВывода) Тогда
					Если (НомерСтроки = 1 И ВыводШапки = 0) ИЛИ (НомерСтроки = 0 И ВыводШапки = 1) Тогда
						ВыводШапки = 2;
						ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);
					КонецЕсли;
				Иначе
					ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
					ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);
				КонецЕсли;
				
				ТабличныйДокумент.Вывести(ОбластьСтрокаТаблицы);
				
				Если Не НаборыСервер.ИспользоватьОбластьКомплектующие(СтрокаТовары, ИспользоватьНаборы) Тогда
					Сумма = Сумма + СтрокаТовары.Сумма;
					СуммаНДС = СуммаНДС + СтрокаТовары.СуммаНДС;
					
					Если ЕстьСкидки Тогда
						ВсегоСкидок = ВсегоСкидок + СтрокаТовары.СуммаСкидки;
						ВсегоБезСкидок = ВсегоБезСкидок + СтрокаТовары.СуммаБезСкидки;
					КонецЕсли;
				
					Если ДанныеПечати.УчитыватьНДС И НЕ ТолькоЗалогЗаТару Тогда
						СуммаНДСПоСтавке = СоответствиеСтавокНДС[СтрокаТовары.СтавкаНДС];
						Если СуммаНДСПоСтавке = Неопределено Тогда
							СуммаНДСПоСтавке = 0;
						КонецЕсли;
						СоответствиеСтавокНДС.Вставить(СтрокаТовары.СтавкаНДС, СуммаНДСПоСтавке + СтрокаТовары.СуммаНДС);
					КонецЕсли;
				
				КонецЕсли;
				
			КонецЦикла;
			
			СтруктураДанныхВсегоСкидки = Новый Структура;
			
			// Подвал таблицы "Товары"
			Если ЕстьСкидки Тогда
				СтруктураДанныхВсегоСкидки.Вставить("ВсегоСкидок", ?(ЗаголовокСкидки.ТолькоНаценка,-ВсегоСкидок, ВсегоСкидок));
				СтруктураДанныхВсегоСкидки.Вставить("ВсегоБезСкидок", ВсегоБезСкидок);
				Если ДанныеПечати.УчитыватьНДС И НЕ ТолькоЗалогЗаТару Тогда
					СтруктураДанныхВсегоСкидки.Вставить("ВсегоСуммаНДС", СуммаНДС);
				КонецЕсли;
			КонецЕсли;
			СтруктураДанныхВсегоСкидки.Вставить("Всего", ФормированиеПечатныхФорм.ФорматСумм(Сумма));
			ОбластьПодвалТаблицы.Параметры.Заполнить(СтруктураДанныхВсегоСкидки);
			ТабличныйДокумент.Вывести(ОбластьПодвалТаблицы);
			
			// Область "ПодвалТаблицыНДС"
			Если ДанныеПечати.УчитыватьНДС И НЕ ТолькоЗалогЗаТару И НЕ ДанныеПечати.ОперацияОблагаетсяНДСУПокупателя Тогда
				
				Для Каждого ТекСтавкаНДС Из СоответствиеСтавокНДС Цикл
					
					СтруктураДанныхПодвалНДС = Новый Структура;
					СтруктураДанныхПодвалНДС.Вставить("НДС", ФормированиеПечатныхФорм.ТекстНДСПоСтавке(ТекСтавкаНДС.Ключ, ДанныеПечати.ЦенаВключаетНДС));
					СтруктураДанныхПодвалНДС.Вставить("ВсегоНДС", ФормированиеПечатныхФорм.ФорматСумм(ТекСтавкаНДС.Значение, ,"-"));
					ОбластьПодвалНДС.Параметры.Заполнить(СтруктураДанныхПодвалНДС);
					ТабличныйДокумент.Вывести(ОбластьПодвалНДС);
					
				КонецЦикла;
				
				СтруктураДанныхПодвалНДС = Новый Структура;
				СтруктураДанныхПодвалНДС.Вставить("ВсегоСНДС", ФормированиеПечатныхФорм.ФорматСумм(Сумма + ?(ДанныеПечати.ЦенаВключаетНДС, 0, СуммаНДС)));
				ОбластьПодвалСНДС.Параметры.Заполнить(СтруктураДанныхПодвалНДС);
				ТабличныйДокумент.Вывести(ОбластьПодвалСНДС);
				
			ИначеЕсли ИспользуетсяУчетНДС Тогда
				СтруктураДанныхПодвалНДС = Новый Структура;
				Если ДанныеПечати.ОперацияОблагаетсяНДСУПокупателя Тогда
					СтруктураДанныхПодвалНДС.Вставить("НДС", НСтр("ru = 'НДС исчисляется налоговым агентом';
																	|en = 'VAT is calculated by tax agent'", ОбщегоНазначения.КодОсновногоЯзыка()));
				Иначе
					СтруктураДанныхПодвалНДС.Вставить("НДС", НСтр("ru = 'Без налога (НДС)';
																	|en = 'Without tax (VAT)'", ОбщегоНазначения.КодОсновногоЯзыка()));
				КонецЕсли;
				СтруктураДанныхПодвалНДС.Вставить("ВсегоНДС", "-");
				ОбластьПодвалНДС.Параметры.Заполнить(СтруктураДанныхПодвалНДС);
				ТабличныйДокумент.Вывести(ОбластьПодвалНДС);
			КонецЕсли;
			
			// Вывести Сумму прописью
			СуммаКПрописи = Сумма + ?(ДанныеПечати.ЦенаВключаетНДС, 0, СуммаНДС);
			ИтоговаяСтрока = НСтр("ru = 'Всего наименований %Количество%, на сумму %Сумма%';
									|en = 'Total number of names %Количество% in the amount of %Сумма%'", ОбщегоНазначения.КодОсновногоЯзыка());
			ИтоговаяСтрока = СтрЗаменить(ИтоговаяСтрока, "%Количество%", НомерСтроки);
			ИтоговаяСтрока = СтрЗаменить(ИтоговаяСтрока, "%Сумма%",      ФормированиеПечатныхФорм.ФорматСумм(СуммаКПрописи, ДанныеПечати.Валюта));
			
			СтруктураДанныхСуммаПрописью = Новый Структура;
			Если ДанныеПечати.СчетКВозврату Тогда
				
				СуммаКВозврату = ДанныеПечати.СуммаКВозврату;
				СуммаИтого = СуммаКПрописи-СуммаКВозврату;
				Если СуммаИтого < 0 Тогда
					СуммаИтого = 0;
				КонецЕсли;
				СтруктураДанныхСуммаПрописью.Вставить("СуммаВозврата", ФормированиеПечатныхФорм.ФорматСумм(СуммаКВозврату, ДанныеПечати.Валюта));
				СтруктураДанныхСуммаПрописью.Вставить("СуммаИтогоКОплате", ФормированиеПечатныхФорм.ФорматСумм(СуммаИтого, ДанныеПечати.Валюта, "0"));
				СтруктураДанныхСуммаПрописью.Вставить("СуммаПрописью", РаботаСКурсамиВалютУТ.СформироватьСуммуПрописью(СуммаИтого, ДанныеПечати.Валюта));
			Иначе
				
				СтруктураДанныхСуммаПрописью.Вставить("СуммаПрописью", РаботаСКурсамиВалютУТ.СформироватьСуммуПрописью(СуммаКПрописи, ДанныеПечати.Валюта));
			КонецЕсли;
			
			СтруктураДанныхСуммаПрописью.Вставить("ИтоговаяСтрока", ИтоговаяСтрока);
			ОбластьСуммаПрописью.Параметры.Заполнить(СтруктураДанныхСуммаПрописью);
			ТабличныйДокумент.Вывести(ОбластьСуммаПрописью);
		КонецЕсли;
		//·++·Гурьев·08.08.23·#2_11_4·Выбор иной процедуры, если ПФ заполняется из документа СчетНаОплатуКлиенту
		ЗаполнитьРеквизитыПодвалаСчетаНаОплату_СчетНаОплатуКлиенту(ДанныеПечати, Макет, ТабличныйДокумент, ТаблицаЭтапыОплаты, СоответствиеСтавокНДС, ПараметрыПечати);
		//·--·Гурьев·08.08.23
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ДанныеПечати.Ссылка);
		
	КонецЦикла;

КонецПроцедуры

Процедура ЗаполнитьРеквизитыШапкиСчетаНаОплату_СчетНаОплатуКлиенту(ДанныеПечати, Макет, ТабличныйДокумент,ТаблицаЭтапыОплаты,
															ТаблицаТовары, ТаблицаЭтапыГрафикаОплатыЗаказКлиента, ТаблицаДанныеДокументУдостоверяющийЛичность)
	
	//·++·Гурьев·04.08.23·#2_11_4·Смена типового макета на новый
	//Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка.ПечатьСчетовНаОплату.ПФ_MXL_СчетНаОплату");
	Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка.ПечатьСчетовНаОплату.КАНАТ_ПФ_СчетНаОплату");
	//·--·Гурьев·04.08.23
	
	// <+БИТ> Руденков_Е.И. 30.03.2024 
	// #000000222, Счет на оплату. 
	ИспользуетсяКАНАТ_Товары = Ложь;//КАНАТ_Товары - это ТЧ счета на оплату, если используется, то данные берутся из нее, а не из ДокументОснование
	Если ТаблицаТовары.Количество() > 0 Тогда
		текТЗ = ТаблицаТовары[0].Владелец();
		Если текТЗ.Колонки.Найти("СпособДоставки") <> Неопределено 
			И текТЗ.Колонки.Найти("ПеревозчикПартнер") <> Неопределено Тогда
			ИспользуетсяКАНАТ_Товары = Истина;
		КонецЕсли;
	КонецЕсли;
	// <-БИТ> Руденков_Е.И. 30.03.2024
	
	СведенияОПоставщике = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.Организация, ДанныеПечати.Дата);
	
	//·++·Гурьев·09.08.23·#2_11_4·Скрытие заголовка счета
	//ОбластьМакета = Макет.ПолучитьОбласть("ЗаголовокСчета");
	//ФормированиеПечатныхФорм.ВывестиЛоготипВТабличныйДокумент(Макет, ОбластьМакета, "ЗаголовокСчетаЛоготип", ДанныеПечати.Организация);
	//ШтрихкодированиеПечатныхФорм.ВывестиШтрихкодВТабличныйДокумент(ТабличныйДокумент, Макет, ОбластьМакета, ДанныеПечати.Ссылка);
	//	
	//Если ТаблицаЭтапыОплаты.Количество() = 0 Тогда
	//	ДатаПлатежа = '00010101';
	//ИначеЕсли ТаблицаЭтапыОплаты.Количество() = 1 Тогда
	//	ДатаПлатежа = ТаблицаЭтапыОплаты[0].ДатаПлатежа;
	//Иначе
	//	ДатаПлатежа = ТаблицаЭтапыОплаты[ТаблицаЭтапыОплаты.Количество()-1].ДатаПлатежа;
	//КонецЕсли;
	//
	//Если ЗначениеЗаполнено(ДатаПлатежа) Тогда
	//	СтруктураДанныхЗаголовок = Новый Структура;
	//	НадписьСрокДействия = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
	//		НСтр("ru = 'Счет действителен до %1.';
	//			|en = 'Account is valid till %1.'", ОбщегоНазначения.КодОсновногоЯзыка()), Формат(ДатаПлатежа, "ДЛФ=D")) + " ";
	//	СтруктураДанныхЗаголовок.Вставить("СрокДействия", НадписьСрокДействия);
	//	ОбластьМакета.Параметры.Заполнить(СтруктураДанныхЗаголовок);
	//КонецЕсли;
	//
	//ТабличныйДокумент.Вывести(ОбластьМакета);
	//·--·Гурьев·09.08.23

	Если ДанныеПечати.ПлатежЗаРубеж Тогда
		
		ОбластьМакета = Макет.ПолучитьОбласть("ОбразецЗаполненияРеквизитыБанка");
		СтруктураДанныхШапки = Новый Структура;
		ПредставлениеПоставщикаДляПлатПоручения = "";
		
		Если ЗначениеЗаполнено(ДанныеПечати.БанковскийСчет) Тогда
			СтруктураДанныхШапки.Вставить("СчетБанкаПолучателяПредставление", ДанныеПечати.НомерБанковскогоСчета);
			СтруктураДанныхШапки.Вставить("БанкПолучателяПредставление", ДанныеПечати.НаименованиеБанкаМеждународное);
			Если ПустаяСтрока(СтруктураДанныхШапки.БанкПолучателяПредставление) Тогда
				СтруктураДанныхШапки.Вставить("БанкПолучателяПредставление", ДанныеПечати.НаименованиеБанка);
			КонецЕсли; 
			СтруктураДанныхШапки.Вставить("АдресБанкаПолучателяПредставление", ДанныеПечати.АдресБанка);
			СтруктураДанныхШапки.Вставить("СВИФТБанка", ДанныеПечати.СВИФТБанка);
			ПредставлениеПоставщикаДляПлатПоручения = ДанныеПечати.БанковскийСчетТекстКорреспондента;
		КонецЕсли;
		
		Если ПустаяСтрока(ПредставлениеПоставщикаДляПлатПоручения) Тогда
			ПредставлениеПоставщикаДляПлатПоручения = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПоставщике, "ПолноеНаименование,");
		КонецЕсли;
		СтруктураДанныхШапки.Вставить("ПредставлениеПоставщикаДляПлатПоручения", ПредставлениеПоставщикаДляПлатПоручения);
		ОбластьМакета.Параметры.Заполнить(СтруктураДанныхШапки);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		Если Не ПустаяСтрока(ДанныеПечати.НаименованиеБанкаДляРасчетовМеждународное) Тогда
			ОбластьМакета = Макет.ПолучитьОбласть("ОбразецЗаполненияРеквизитыБанкаКорреспондента");
			
			СтруктураДанныхШапки.Очистить();
			СтруктураДанныхШапки.Вставить("БанкКорреспондентПолучателяПредставление",
				ДанныеПечати.НаименованиеБанкаДляРасчетовМеждународное + " " + ДанныеПечати.АдресБанкаДляРасчетов);
			СтруктураДанныхШапки.Вставить("СВИФТБанкаДляРасчетов", ДанныеПечати.СВИФТБанкаДляРасчетов);
			СтруктураДанныхШапки.Вставить("СчетБанкаДляРасчетовПредставление", ДанныеПечати.СчетВБанкеДляРасчетов);
			
			ОбластьМакета.Параметры.Заполнить(СтруктураДанныхШапки);
			ТабличныйДокумент.Вывести(ОбластьМакета);
		КонецЕсли;
		
		ОбластьМакета = Макет.ПолучитьОбласть("ОбразецЗаполненияНазначениеПлатежа");
		СтруктураДанныхШапки.Очистить();
		Если Не ЗначениеЗаполнено(ДанныеПечати.НазначениеПлатежа)
			И ТипЗнч(ДанныеПечати.Ссылка) <> Тип("ДокументСсылка.СчетНаОплатуКлиенту") Тогда
			СтруктураДанныхШапки.Вставить("НазначениеПлатежа", Документы.СчетНаОплатуКлиенту.СформироватьНазначениеПлатежа(
				ДанныеПечати.Номер, ДанныеПечати.Ссылка));
		Иначе
			// <+БИТ> Руденков_Е.И. 30.03.2024 
			// #000000222, Счет на оплату. 
			//СтруктураДанныхШапки.Вставить("НазначениеПлатежа", ДанныеПечати.НазначениеПлатежа);
			СтруктураДанныхШапки.Вставить("НазначениеПлатежа", Документы.СчетНаОплатуКлиенту.СформироватьНазначениеПлатежа(
				ДанныеПечати.Номер, ДанныеПечати.Ссылка.ДокументОснование));
			// <-БИТ> Руденков_Е.И. 30.03.2024
		КонецЕсли;
		ОбластьМакета.Параметры.Заполнить(СтруктураДанныхШапки);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
	Иначе
	
		Если ДанныеПечати.КонтрагентЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо
			И ЗначениеЗаполнено(ДанныеПечати.БанковскийСчет) Тогда
			ОбластьМакета = Макет.ПолучитьОбласть("ОбразецЗаполненияППСКодом");
		Иначе
			ОбластьМакета = Макет.ПолучитьОбласть("ОбразецЗаполненияПП");
		КонецЕсли;
		
		СтруктураДанныхШапки = Новый Структура;
		СтруктураДанныхШапки.Вставить("ИНН", СведенияОПоставщике.ИНН);
		СтруктураДанныхШапки.Вставить("КПП",СведенияОПоставщике.КПП);
		ПредставлениеПоставщикаДляПлатПоручения = "";
		
		СтруктураДанныхШапки.Вставить("ИдентификаторПлатежа", ДанныеПечати.ИдентификаторПлатежа);
		
		Если ЗначениеЗаполнено(ДанныеПечати.БанковскийСчет) Тогда
			
			Если ЗначениеЗаполнено(ДанныеПечати.БИКБанкаДляРасчетов) Тогда
				Банк        = ?(ЗначениеЗаполнено(ДанныеПечати.НаименованиеРКЦБанкаДляРасчетов),
								ДанныеПечати.НаименованиеРКЦБанкаДляРасчетов + "//" + ДанныеПечати.НаименованиеБанкаДляРасчетов,
								ДанныеПечати.НаименованиеБанкаДляРасчетов);
				БИК         = ДанныеПечати.БИКБанкаДляРасчетов;
				КоррСчет    = ДанныеПечати.КоррСчетБанкаДляРасчетов;
				ГородБанка  = ДанныеПечати.ГородБанкаДляРасчетов;
				НомерСчета  = ДанныеПечати.КоррСчетБанка;
			Иначе
				Банк        = ?(ЗначениеЗаполнено(ДанныеПечати.НаименованиеРКЦБанка),
								ДанныеПечати.НаименованиеРКЦБанка + "//" + ДанныеПечати.НаименованиеБанка,
								ДанныеПечати.НаименованиеБанка);
				БИК         = ДанныеПечати.БИКБанк;
				КоррСчет    = ДанныеПечати.КоррСчетБанка;
				ГородБанка  = ДанныеПечати.ГородБанка;
				НомерСчета  = ДанныеПечати.НомерБанковскогоСчета;
			КонецЕсли;
			
			СтруктураДанныхШапки.Вставить("БИКБанкаПолучателя", БИК);
			СтруктураДанныхШапки.Вставить("БанкПолучателя", Банк);
			СтруктураДанныхШапки.Вставить("БанкПолучателяПредставление", СокрЛП(Банк) + " " + ГородБанка);
			СтруктураДанныхШапки.Вставить("СчетБанкаПолучателя", КоррСчет);
			СтруктураДанныхШапки.Вставить("СчетБанкаПолучателяПредставление", КоррСчет);
			СтруктураДанныхШапки.Вставить("СчетПолучателяПредставление", НомерСчета);
			СтруктураДанныхШапки.Вставить("СчетПолучателя", НомерСчета);
			ПредставлениеПоставщикаДляПлатПоручения = ДанныеПечати.БанковскийСчетТекстКорреспондента;
			
		КонецЕсли;
	
		Если ПустаяСтрока(ПредставлениеПоставщикаДляПлатПоручения) Тогда
			ПредставлениеПоставщикаДляПлатПоручения = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПоставщике, "ПолноеНаименование,");
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ДанныеПечати.НазначениеПлатежа)
			И ТипЗнч(ДанныеПечати.Ссылка) <> Тип("ДокументСсылка.СчетНаОплатуКлиенту") Тогда
			
			СтруктураДанныхШапки.Вставить("НазначениеПлатежа", Документы.СчетНаОплатуКлиенту.СформироватьНазначениеПлатежа(
				ДанныеПечати.Номер, ДанныеПечати.Ссылка));
			
		Иначе
			// <+БИТ> Руденков_Е.И. 30.03.2024 
			// #000000222, Счет на оплату. 
			//СтруктураДанныхШапки.Вставить("НазначениеПлатежа", ДанныеПечати.НазначениеПлатежа);
			СтруктураДанныхШапки.Вставить("НазначениеПлатежа", Документы.СчетНаОплатуКлиенту.СформироватьНазначениеПлатежа(
				ДанныеПечати.Номер, ДанныеПечати.Ссылка.ДокументОснование));
			// <-БИТ> Руденков_Е.И. 30.03.2024
		КонецЕсли;
		
		СтруктураДанныхШапки.Вставить("ПредставлениеПоставщикаДляПлатПоручения", ПредставлениеПоставщикаДляПлатПоручения);
		ОбластьМакета.Параметры.Заполнить(СтруктураДанныхШапки);
		
		Если ДанныеПечати.КонтрагентЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо
			И ЗначениеЗаполнено(ДанныеПечати.БанковскийСчет) Тогда
			
			РеквизитыПлатежа = РеквизитыПлатежаQRКод(СтруктураДанныхШапки);
			РеквизитыПлатежа.СуммаЧислом = СуммаКОплатеПоСчету(ДанныеПечати, ТаблицаТовары);
			РеквизитыПлатежа.Ссылка = ДанныеПечати.Ссылка;
			
			ВывестиQRКод(РеквизитыПлатежа, ДанныеПечати, ОбластьМакета);
			
		КонецЕсли;
		
		ТабличныйДокумент.Вывести(ОбластьМакета);
	КонецЕсли;
	
	КолонкаКодов = ФормированиеПечатныхФорм.ДополнительнаяКолонкаПечатныхФормДокументов().ИмяКолонки;
	ВыводитьКоды = ЗначениеЗаполнено(КолонкаКодов);
	
	Смещать = ТипСмещенияТабличногоДокумента.ПоВертикали;
	ОбластьПервойКолонкиТоваров = Макет.Область("ПерваяКолонкаТовара");
	Если НЕ ВыводитьКоды Тогда
		ОбластьПервойКолонкиТоваров.ШиринаКолонки = ОбластьПервойКолонкиТоваров.ШиринаКолонки + Макет.Область("КолонкаКодов").ШиринаКолонки;
		Макет.УдалитьОбласть(Макет.Область("КолонкаКодов"), Смещать);
	КонецЕсли;
	
	//·++·Гурьев·07.08.23·#2_11_4·Замена выбираемого поля макета
	//ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	ОбластьМакета = Макет.ПолучитьОбласть("КАНАТ_Заголовок");
	//·--·Гурьев·07.08.23
	
	ТекстЗаголовка = ОбщегоНазначенияУТКлиентСервер.СформироватьЗаголовокДокумента(ДанныеПечати, НСтр("ru = 'Счет на оплату';
																										|en = 'Commercial invoice'", ОбщегоНазначения.КодОсновногоЯзыка()));
	СтруктураДанныхШапки = Новый Структура;
	СтруктураДанныхШапки.Вставить("ТекстЗаголовка", ТекстЗаголовка);
	ОбластьМакета.Параметры.Заполнить(СтруктураДанныхШапки);
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	//·++·Гурьев·07.08.23·#2_11_4·Замена выбираемого поля макета
	//ОбластьМакета = Макет.ПолучитьОбласть("Поставщик");
	ОбластьМакета = Макет.ПолучитьОбласть("КАНАТ_Поставщик");
	//·--·Гурьев·07.08.23
	
	СтруктураДанныхПоставщик = Новый Структура;
	СтруктураДанныхПоставщик.Вставить("ПредставлениеПоставщика", 
		ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.ОрганизацияПоставщик, ДанныеПечати.Дата),
			"ПолноеНаименование,ИНН,КПП,ЮридическийАдрес,Телефоны"));
	ОбластьМакета.Параметры.Заполнить(СтруктураДанныхПоставщик);
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	//·++·Гурьев·07.08.23·#2_11_4·Объединение Покупателя и Грузополучателя в одну строку
	//ОбластьМакета = Макет.ПолучитьОбласть("Покупатель");
	//СтруктураДанныхПокупатель = Новый Структура;
	//СтруктураДанныхПокупатель.Вставить("ПредставлениеПолучателя", 
	//	ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.Контрагент, ДанныеПечати.Дата),
	//		"ПолноеНаименование,ИНН,КПП,ЮридическийАдрес,Телефоны,"));
	//ОбластьМакета.Параметры.Заполнить(СтруктураДанныхПокупатель);
	//ТабличныйДокумент.Вывести(ОбластьМакета);
	//
	//Если ЗначениеЗаполнено(ДанныеПечати.Грузоотправитель) Тогда
	//	ОбластьМакета = Макет.ПолучитьОбласть("Грузоотправитель");
	//	СтруктураДаннСтруктураДанныхПокупатель = Новый Структура;
	//СтруктураДанныхПокупатель.Вставить("ПредставлениеПолучателя", 
	//	ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.Контрагент, ДанныеПечати.Дата),
	//		"ПолноеНаименование,ИНН,КПП,ЮридическийАдрес,Телефоны,"));
	//ОбластьМакета.Параметры.Заполнить(СтруктураДанныхПокупатель);
	//ТабличныйДокумент.Вывести(ОбластьМакета);ыхГрузоотправитель = Новый Структура;
	//	СтруктураДанныхГрузоотправитель.Вставить("ПредставлениеГрузоотправителя", ОписаниеОрганизации(ДанныеПечати, "Грузоотправитель"));
	//	ОбластьМакета.Параметры.Заполнить(СтруктураДанныхГрузоотправитель);
	//	ТабличныйДокумент.Вывести(ОбластьМакета);
	//КонецЕсли;
	//
	//Если ЗначениеЗаполнено(ДанныеПечати.Грузополучатель) Тогда
	//	ОбластьМакета = Макет.ПолучитьОбласть("Грузополучатель");
	//	СтруктураДанныхГрузополучатель = Новый Структура;
	//	СтруктураДанныхГрузополучатель.Вставить("ПредставлениеГрузополучателя", ОписаниеОрганизации(ДанныеПечати, "Грузополучатель"));
	//	ОбластьМакета.Параметры.Заполнить(СтруктураДанныхГрузополучатель);
	//	ТабличныйДокумент.Вывести(ОбластьМакета);
	//КонецЕсли;
	ОбластьМакета = Макет.ПолучитьОбласть("КАНАТ_ПокупательГрузополучатель");
	СтруктураДанныхПокупательГрузополучатель = Новый Структура;
	СтруктураДанныхПокупательГрузополучатель.Вставить("ПредставлениеПолучателя", 
		ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.Контрагент, ДанныеПечати.Дата),
			"ПолноеНаименование,ИНН,КПП,ЮридическийАдрес,Телефоны"));
	Если ЗначениеЗаполнено(ДанныеПечати.Грузополучатель) Тогда
		// <+БИТ> Руденков_Е.И. 30.03.2024 
		// #000000222, Счет на оплату. 
		//СтруктураДанныхПокупательГрузополучатель.Вставить("ПредставлениеГрузополучателя",
		//	ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.Грузополучатель, ДанныеПечати.Дата),
		//		"ПолноеНаименование,ИНН,КПП,ЮридическийАдрес,Телефоны,АдресЭлектроннойПочты"));
		//Если ИспользуетсяКАНАТ_Товары Тогда
		//	СтруктураДанныхПокупательГрузополучатель.Вставить("ПредставлениеГрузополучателя",
		//		ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ТаблицаТовары[0].Грузополучатель, ДанныеПечати.Дата),
		//			"ПолноеНаименование,ИНН,КПП,ЮридическийАдрес,Телефоны,АдресЭлектроннойПочты"));
		//Иначе
		//	СтруктураДанныхПокупательГрузополучатель.Вставить("ПредставлениеГрузополучателя",
		//		ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.Грузополучатель, ДанныеПечати.Дата),
		//			"ПолноеНаименование,ИНН,КПП,ЮридическийАдрес,Телефоны,АдресЭлектроннойПочты"));
		//КонецЕсли;
		// <-БИТ> Руденков_Е.И. 30.03.2024
		//VVLarionov
		СтруктураДанныхПокупательГрузополучатель.Вставить("ПредставлениеГрузополучателя",
			ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.Грузополучатель, ДанныеПечати.Дата),
				"ПолноеНаименование,ИНН,КПП,ЮридическийАдрес,Телефоны"));
	
		//VVLarionov
	КонецЕсли;
	ОбластьМакета.Параметры.Заполнить(СтруктураДанныхПокупательГрузополучатель);
	ТабличныйДокумент.Вывести(ОбластьМакета);
	//·--·Гурьев·07.08.23
	
	//·++·Гурьев·07.08.23·#2_11_4·Добавление новых полей на печатную форму
	ОбластьМакета = Макет.ПолучитьОбласть("КАНАТ_ФормаОплаты");
	Если ДанныеПечати.Ссылка.КАНАТ_ИспользоватьФормуОплаты Тогда
		ОбластьМакета.Параметры.ФормаОплаты = ДанныеПечати.Ссылка.КАНАТ_ФормаОплаты;
	Иначе
		
		Если ТаблицаЭтапыГрафикаОплатыЗаказКлиента.Количество() > 0 Тогда
			Если ТаблицаЭтапыГрафикаОплатыЗаказКлиента[0].ВариантОтсчета = Перечисления.ВариантыОтсчетаДатыПлатежа.ОтДатыОтгрузки Тогда
				ФормаОплаты = "Постоплата ";
			Иначе
				ФормаОплаты = "Предоплата ";
			КонецЕсли;
			ОбластьМакета.Параметры.ФормаОплаты = ФормаОплаты + Строка(ТаблицаЭтапыГрафикаОплатыЗаказКлиента[0].ПроцентПлатежа) + "%";
		КонецЕсли;
		
	КонецЕсли;
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("КАНАТ_Сроки");
	СтруктураДанныхСроки = Новый Структура;
	Если ТаблицаЭтапыГрафикаОплатыЗаказКлиента.Количество() > 0 Тогда
		// <+БИТ> Руденков_Е.И. 30.03.2024 
		// #000000222, Счет на оплату. 
		//СтруктураДанныхСроки.Вставить("СрокОплаты", Формат(ТаблицаЭтапыОплаты[0].ДатаПлатежа, "ДФ=dd.MM.yy"));
		СтруктураДанныхСроки.Вставить("СрокОплаты", Формат(ПолучитьСрокОплаты(ДанныеПечати.Ссылка.Дата), "ДФ=dd.MM.yy"));
		// <-БИТ> Руденков_Е.И. 30.03.2024
	КонецЕсли;
	// <+БИТ> Руденков_Е.И. 30.03.2024 
	// #000000222, Счет на оплату. 
	//Если ДанныеПечати.НеОтгружатьЧастями И ЗначениеЗаполнено(ДанныеПечати.ДатаОтгрузки) Тогда
	//	СрокОтгрузки = ДанныеПечати.ДатаОтгрузки;
	//Иначе
	//	СрокОтгрузки = "Согласовывается дополнительно";
	//КонецЕсли;
	Если ИспользуетсяКАНАТ_Товары Тогда
		Если ТаблицаТовары[0].НеОтгружатьЧастями И ЗначениеЗаполнено(ТаблицаТовары[0].ДатаОтгрузкиОснования) Тогда
			СрокОтгрузки = ТаблицаТовары[0].ДатаОтгрузкиОснования;
		Иначе
			СрокОтгрузки = "Согласовывается дополнительно";
		КонецЕсли;
	Иначе
		Если ДанныеПечати.НеОтгружатьЧастями И ЗначениеЗаполнено(ДанныеПечати.ДатаОтгрузки) Тогда
			СрокОтгрузки = ДанныеПечати.ДатаОтгрузки;
		Иначе
			СрокОтгрузки = "Согласовывается дополнительно";
		КонецЕсли;
	КонецЕсли;
	
	// <-БИТ> Руденков_Е.И. 30.03.2024
	СтруктураДанныхСроки.Вставить("СрокОтгрузки", Формат(СрокОтгрузки, "ДФ=dd.MM.yy"));
	ОбластьМакета.Параметры.Заполнить(СтруктураДанныхСроки);
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("КАНАТ_Доставка");
	СтруктураДанныхДоставка = Новый Структура;
	// <+БИТ> Руденков_Е.И. 29.03.2024 
	// #000000222, Счет на оплату. 
	//СтруктураДанныхДоставка.Вставить("Доставка", ДанныеПечати.СпособДоставки);
	Если ТаблицаТовары.Количество() > 0 Тогда
		текТЗ = ТаблицаТовары[0].Владелец();
		Если текТЗ.Колонки.Найти("СпособДоставки") <> Неопределено 
			И текТЗ.Колонки.Найти("ПеревозчикПартнер") <> Неопределено Тогда
			//Значит сюда передана не ТЧ документа основания, а ТЧ КАНАТ_Товары счета на оплату
			//В каждой строке ТЗ СпособДоставки одинаковый, возмем из 1-й строки
			Если ТаблицаТовары[0].СпособДоставки = Перечисления.СпособыДоставки.СиламиПеревозчикаПоАдресу Тогда
				//БИТ_Гурьев__27.04.24++
				//ТекСпособДоставки = "Доставка до " + ТаблицаТовары[0].ПеревозчикПартнер;
				ТекСпособДоставки = ТаблицаТовары[0].ПеревозчикПартнер;
				//БИТ_Гурьев__27.04.24--
			Иначе
				ТекСпособДоставки = ТаблицаТовары[0].СпособДоставки;
			КонецЕсли;
			СтруктураДанныхДоставка.Вставить("Доставка", ТекСпособДоставки);
		Иначе
			СтруктураДанныхДоставка.Вставить("Доставка", ДанныеПечати.СпособДоставки);
		КонецЕсли;
	Иначе
		СтруктураДанныхДоставка.Вставить("Доставка", ДанныеПечати.СпособДоставки);
	КонецЕсли;
	// <-БИТ> Руденков_Е.И. 29.03.2024
	// <+БИТ> Руденков_Е.И. 30.03.2024 
	// #000000222, Счет на оплату. 
	//СтруктураДанныхДоставка.Вставить("ПлатитЗаДоставку", ДанныеПечати.ПлатитЗаДоставку);
	Если ИспользуетсяКАНАТ_Товары Тогда
		СтруктураДанныхДоставка.Вставить("ПлатитЗаДоставку", ТаблицаТовары[0].КАНАТ_ПлатитЗаДоставку);
	Иначе
		СтруктураДанныхДоставка.Вставить("ПлатитЗаДоставку", ДанныеПечати.ПлатитЗаДоставку);
	КонецЕсли;
	// <-БИТ> Руденков_Е.И. 30.03.2024
	ОбластьМакета.Параметры.Заполнить(СтруктураДанныхДоставка);
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("КАНАТ_АдресДоставки");
	СтруктураДанныхДоставка = Новый Структура;
	// <+БИТ> Руденков_Е.И. 30.03.2024 
	// #000000222, Счет на оплату. 
	//Если ТаблицаДанныеДокументУдостоверяющийЛичность.Количество() > 0 Тогда
	//	СтруктураДанныхДоставка.Вставить("АдресДоставки", ДанныеПечати.АдресДоставки + " (" + ТаблицаДанныеДокументУдостоверяющийЛичность[0].Представление + ")");
	//Иначе
	//	СтруктураДанныхДоставка.Вставить("АдресДоставки", ДанныеПечати.АдресДоставки);
	//КонецЕсли;
	//Если ИспользуетсяКАНАТ_Товары Тогда
	//	Если ТаблицаДанныеДокументУдостоверяющийЛичность.Количество() > 0 Тогда
	//		СтруктураДанныхДоставка.Вставить("АдресДоставки", ТаблицаТовары[0].АдресДоставки + " (" + ТаблицаДанныеДокументУдостоверяющийЛичность[0].Представление + ")");
	//	Иначе
	//		СтруктураДанныхДоставка.Вставить("АдресДоставки", ТаблицаТовары[0].АдресДоставки);
	//	КонецЕсли;
	//Иначе
	//	Если ТаблицаДанныеДокументУдостоверяющийЛичность.Количество() > 0 Тогда
	//		СтруктураДанныхДоставка.Вставить("АдресДоставки", ДанныеПечати.АдресДоставки + " (" + ТаблицаДанныеДокументУдостоверяющийЛичность[0].Представление + ")");
	//	Иначе
	//		СтруктураДанныхДоставка.Вставить("АдресДоставки", ДанныеПечати.АдресДоставки);
	//	КонецЕсли;
	//КонецЕсли;  
	Если ДанныеПечати.Грузополучатель.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо ТОгда
		СтруктураДанныхДоставка.Вставить("АдресДоставки", ДанныеПечати.АдресДоставки);	
	Иначе 
		Если ЗначениеЗаполнено(ДанныеПечати.Грузополучатель) ТОгда
			Паспортные = РегистрыСведений.ДокументыФизическихЛиц.ДокументУдостоверяющийЛичностьФизлица(ДанныеПечати.Грузополучатель,ДанныеПечати.Дата);
		Иначе
			Паспортные = РегистрыСведений.ДокументыФизическихЛиц.ДокументУдостоверяющийЛичностьФизлица(ДанныеПечати.Контрагент,ДанныеПечати.Дата);
			
		КонецЕсли;
		
		СтруктураДанныхДоставка.Вставить("АдресДоставки", ДанныеПечати.АдресДоставки + " (" + Паспортные + ")");
	КонецЕсли;
	
	// <-БИТ> Руденков_Е.И. 30.03.2024
	ОбластьМакета.Параметры.Заполнить(СтруктураДанныхДоставка);
	ТабличныйДокумент.Вывести(ОбластьМакета);
	//·--·Гурьев·07.08.23
	//БИТ_Гурьев_Правки_17.07.24++
	Если (ЗначениеЗаполнено(ДанныеПечати.ДоговорСУчастникомГОЗ) И ДанныеПечати.ДоговорСУчастникомГОЗ = Истина) Тогда
		Область = Макет.ПолучитьОбласть("КАНАТ_ИГК");
		Область.Параметры.ИГК = ДанныеПечати.Ссылка.Договор.ГосударственныйКонтракт.НомерИГК;
		ТабличныйДокумент.Вывести(Область);
	КонецЕсли;
	//БИТ_Гурьев_Правки_17.07.24--
	//БИТ_Гурьев__27.04.24++
	Если ЗначениеЗаполнено(ДанныеПечати.ДополнительнаяИнформация) Тогда
		
		Область = Макет.ПолучитьОбласть("ДополнительнаяИнформация");
		Область.Параметры.Заполнить(ДанныеПечати);
		ТабличныйДокумент.Вывести(Область);
		
	КонецЕсли;
	//БИТ_Гурьев__27.04.24--
КонецПроцедуры

//&Вместо("СформироватьПечатнуюФормуСчетНаОплату")
//Функция КАНАТ_СформироватьПечатнуюФормуСчетНаОплату(СтруктураТипов, ОбъектыПечати, ПараметрыПечати)
//	
//	ТабличныйДокумент = Новый ТабличныйДокумент;
//	ТабличныйДокумент.АвтоМасштаб = Истина;
//	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СЧЕТНАОПЛАТУ";
//	
//	НомерТипаДокумента = 0;
//	
//	УстановитьПривилегированныйРежим(Истина);
//	
//	Для Каждого СтруктураОбъектов Из СтруктураТипов Цикл
//		
//		НомерТипаДокумента = НомерТипаДокумента + 1;
//		Если НомерТипаДокумента > 1 Тогда
//			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
//		КонецЕсли;
//		
//		МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(СтруктураОбъектов.Ключ);
//		ДанныеДляПечати = МенеджерОбъекта.ПолучитьДанныеДляПечатнойФормыСчетаНаОплату(ПараметрыПечати, СтруктураОбъектов.Значение);
//		
//		//·++·Гурьев·07.08.23·#2_11_4·Выбор иной процедуры, если ПФ заполняется из документа СчетНаОплатуКлиенту
//		
//		Если СтруктураОбъектов.Ключ = "Документ.СчетНаОплатуКлиенту" Тогда
//			ПроверкаОснованиеЗаказКлиенту = ПроверитьОснованиеЗаказКлиенту(СтруктураОбъектов.Значение);
//			Если ПроверкаОснованиеЗаказКлиенту Тогда
//				ЗаполнитьТабличныйДокументСчетаНаОплату_СчетНаОплатуКлиенту(ТабличныйДокумент, ДанныеДляПечати, ОбъектыПечати, ПараметрыПечати);
//			Иначе 
//				ЗаполнитьТабличныйДокументСчетаНаОплату(ТабличныйДокумент, ДанныеДляПечати, ОбъектыПечати, ПараметрыПечати);
//			КонецЕсли;
//		Иначе
//			ЗаполнитьТабличныйДокументСчетаНаОплату(ТабличныйДокумент, ДанныеДляПечати, ОбъектыПечати, ПараметрыПечати);
//		КонецЕсли;
//		//·--·Гурьев·07.08.23
//		
//	КонецЦикла;
//	
//	УстановитьПривилегированныйРежим(Ложь);
//	
//	Возврат ТабличныйДокумент;
//	
//КонецФункции

Процедура ЗаполнитьРеквизитыПодвалаСчетаНаОплату_СчетНаОплатуКлиенту(ДанныеПечати, Макет, ТабличныйДокумент, ТаблицаЭтапыОплаты, СоответствиеСтавокНДС, ПараметрыПечати)
	МассивПроверкиВывода = Новый Массив;
	
	//·++·Гурьев·14.08.23·#2_11_4·Скрываем этапы оплаты
	// Вывести этапы графика оплаты
	//Если ТаблицаЭтапыОплаты.Количество() > 1 Тогда
	//	
	//	ИмяКолонкиДатыОплаты = ?(ДанныеПечати.СчетКВозврату,
	//		НСтр("ru = 'Дата оплаты или возврата';
	//			|en = 'Date of payment or return'", ОбщегоНазначения.КодОсновногоЯзыка()),
	//		НСтр("ru = 'Дата оплаты';
	//			|en = 'Payment date'", ОбщегоНазначения.КодОсновногоЯзыка()));
	//	
	//	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицыЭтапыОплаты");
	//	ОбластьПодвалТаблицы = Макет.ПолучитьОбласть("ИтогоЭтапыОплаты");
	//	СтруктураДанныхШапки = Новый Структура("ИмяКолонкиДатыОплаты",ИмяКолонкиДатыОплаты);
	//	ОбластьШапкаТаблицы.Параметры.Заполнить(СтруктураДанныхШапки);
	//	МассивПроверкиВывода.Добавить(ОбластьШапкаТаблицы);
	//	МассивПроверкиВывода.Добавить(ОбластьПодвалТаблицы);
	//	
	//	ОбластьСтрокаТаблицы = Макет.ПолучитьОбласть("СтрокаТаблицыЭтапыОплаты");
	//	
	//	НомерЭтапа = 1;
	//	Для Каждого ТекЭтап Из ТаблицаЭтапыОплаты Цикл
	//		
	//		ПараметрыСтроки = НовыеПараметрыСтрокиЭтапа();
	//		ЗаполнитьЗначенияСвойств(ПараметрыСтроки, ТекЭтап);
	//		ПараметрыСтроки.НомерСтроки = НомерЭтапа;
	//		Если Не ПараметрыСтроки.ЭтоЗалогЗаТару Тогда
	//			ПараметрыСтроки.ТекстНДС = ФормированиеПечатныхФорм.СформироватьТекстНДСЭтапаОплаты(
	//				СоответствиеСтавокНДС,
	//				ТекЭтап.ПроцентПлатежа);
	//		Иначе
	//			ПараметрыСтроки.ПроцентПлатежа = "-";
	//			ПараметрыСтроки.ТекстНДС = НСтр("ru = 'Залог за тару. Без налога (НДС).';
	//											|en = 'Packaging deposit. Without tax (VAT).'", ОбщегоНазначения.КодОсновногоЯзыка());
	//		КонецЕсли;
	//		
	//		ОбластьСтрокаТаблицы.Параметры.Заполнить(ПараметрыСтроки);
	//		
	//		МассивПроверкиВывода.Добавить(ОбластьСтрокаТаблицы);
	//		
	//		Если ТабличныйДокумент.ПроверитьВывод(МассивПроверкиВывода) Тогда
	//			Если НомерЭтапа = 1 Тогда
	//				ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);
	//				МассивПроверкиВывода.Удалить(0);
	//			КонецЕсли;
	//		Иначе
	//			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	//			ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);
	//		КонецЕсли;
	//		
	//		ТабличныйДокумент.Вывести(ОбластьСтрокаТаблицы);
	//		МассивПроверкиВывода.Удалить(МассивПроверкиВывода.ВГраница());
	//		
	//		НомерЭтапа = НомерЭтапа + 1;
	//		
	//	КонецЦикла;
	//	ТабличныйДокумент.Вывести(ОбластьПодвалТаблицы);
	//	
	//КонецЕсли;
	//·--·Гурьев·14.08.23
	
	//·++·Гурьев·08.08.23·#2_11_4·Вывод информации
	Область = Макет.ПолучитьОбласть("КАНАТ_ИнформацияПриОплате");
	ТабличныйДокумент.Вывести(Область);
	
	Если НЕ (ЗначениеЗаполнено(ДанныеПечати.ДоговорСУчастникомГОЗ) И ДанныеПечати.ДоговорСУчастникомГОЗ = Истина) Тогда
		Область = Макет.ПолучитьОбласть("КАНАТ_ГосОборонЗаказ");
		ТабличныйДокумент.Вывести(Область);
	КонецЕсли;
	
	Область = Макет.ПолучитьОбласть("КАНАТ_ИнформацияПриОплате2");
	ТабличныйДокумент.Вывести(Область);
	
	Если ДанныеПечати.ВыводитьСкидки И НЕ ДанныеПечати.ДоговорСУчастникомГОЗ Тогда
		
		Скидки = ДействиеСкидокНаценокПоИсточнику(Константы.КАНАТ_СоглашениеДляТиповогоТекстаСкидок.Получить(), ТекущаяДата());
		Если Скидки.Количество() > 0 Тогда
			
			Область = Макет.ПолучитьОбласть("КАНАТ_СкидкиЗаголовок");
			ТабличныйДокумент.Вывести(Область);
			
			Для Каждого Скидка Из Скидки Цикл
				
				Область = Макет.ПолучитьОбласть("КАНАТ_СкидкиТаблица");
				Область.Параметры.ТекстСкидки = Скидка.Наименование + ";";
				ТабличныйДокумент.Вывести(Область);
				
			КонецЦикла;
			
		КонецЕсли;
	КонецЕсли;
	
	Область = Макет.ПолучитьОбласть("КАНАТ_ИнформацияПриОплате3");
	ТабличныйДокумент.Вывести(Область);
	//·--·Гурьев·08.08.23
	
	//БИТ_Гурьев__27.04.24++
	// Вывести дополнительную информацию
	//Если ЗначениеЗаполнено(ДанныеПечати.ДополнительнаяИнформация) Тогда
	//	
	//	Область = Макет.ПолучитьОбласть("ДополнительнаяИнформация");
	//	Область.Параметры.Заполнить(ДанныеПечати);
	//	ТабличныйДокумент.Вывести(Область);
	//	
	//КонецЕсли;
	//БИТ_Гурьев__27.04.24--
	
	ДолжностьРуководителя = ?(ДанныеПечати.ДолжностьРуководителя = "", 
								Нстр("ru = 'Генеральный директор';
									|en = 'CEO'"), 
								ДанныеПечати.ДолжностьРуководителя);
	
	// Вывести подписи
	Область = Макет.ПолучитьОбласть("ПодвалСчета");
	СтруктураДанныхПодвал = Новый Структура;
	СтруктураДанныхПодвал.Вставить("ФИОРуководителя", ДанныеПечати.Руководитель);
	СтруктураДанныхПодвал.Вставить("ДолжностьРуководителя", ДолжностьРуководителя);
	СтруктураДанныхПодвал.Вставить("ФИОБухгалтера", ДанныеПечати.ГлавныйБухгалтер);
	СтруктураДанныхПодвал.Вставить("ФИОМенеджер", ФизическиеЛицаУТ.ФамилияИнициалыФизЛица(ДанныеПечати.Менеджер, ДанныеПечати.Дата));
	Область.Параметры.Заполнить(СтруктураДанныхПодвал);
	
	ФормированиеПечатныхФорм.ВывестиФаксимилеВТабличныйДокумент(Макет, Область, ДанныеПечати.Организация, ПараметрыПечати);
	МассивПроверкиВывода.Очистить();
	МассивПроверкиВывода.Добавить(Область);
	Если НЕ ТабличныйДокумент.ПроверитьВывод(МассивПроверкиВывода) Тогда
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	КонецЕсли;
	ТабличныйДокумент.Вывести(Область);
	
КонецПроцедуры

Функция ДействиеСкидокНаценокПоИсточнику(Источник, Дата)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ДействиеСкидокНаценокСрезПоследних.СкидкаНаценка                                                              КАК СкидкаНаценка,
	|	ЕСТЬNULL(ДействиеСкидокНаценокСрезПоследних.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыДействияСкидок.НеДействует)) КАК Статус,
	|	
	|	ВЫБОР
	|		КОГДА ДействиеСкидокНаценокСрезПоследних.Статус ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК Использование,
	|	
	|	ЕСТЬNULL(ДействиеСкидокНаценокСрезПоследних.Период, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаНачала,
	|	
	|	ВЫБОР КОГДА ДействиеСкидокНаценокСрезПоследних.Период ЕСТЬ NULL ТОГДА
	|		ЕСТЬNULL(ДобавитьКДате(ДействиеСкидокНаценокСрезПервых.Период, ДЕНЬ, -1), ДАТАВРЕМЯ(1, 1, 1)) 
	|	ИНАЧЕ
	|		ЕСТЬNULL(ДобавитьКДате(Таблица.Период, ДЕНЬ, -1), ДАТАВРЕМЯ(1, 1, 1))
	|	КОНЕЦ КАК ДатаОкончания,
	|	ТаблицаСкидкиНаценки.Наименование КАК Наименование
	|	
	|ИЗ
	|	Справочник.СкидкиНаценки КАК ТаблицаСкидкиНаценки
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ
	|			РегистрСведений.ДействиеСкидокНаценок.СрезПоследних(&ДатаСреза, Источник = &Источник) КАК ДействиеСкидокНаценокСрезПоследних
	|			ПО ДействиеСкидокНаценокСрезПоследних.СкидкаНаценка = ТаблицаСкидкиНаценки.Ссылка
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			МИНИМУМ(Т.Период) КАК Период,
	|			Т.СкидкаНаценка КАК СкидкаНаценка
	|		ИЗ
	|			РегистрСведений.ДействиеСкидокНаценок.СрезПоследних(&ДатаСреза, Источник = &Источник) КАК Срез
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДействиеСкидокНаценок КАК Т
	|				ПО (Т.СкидкаНаценка = Срез.СкидкаНаценка)
	|					И Т.Источник = Срез.Источник
	|					И Т.Период > Срез.Период
	|					И Т.Статус <> Срез.Статус
	|		СГРУППИРОВАТЬ ПО
	|			Т.СкидкаНаценка) КАК Таблица
	|		ПО (Таблица.СкидкаНаценка = ТаблицаСкидкиНаценки.Ссылка)
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДействиеСкидокНаценок.СрезПервых(
	|				&ДатаСреза,
	|				Источник = &Источник) КАК ДействиеСкидокНаценокСрезПервых
	|		ПО ДействиеСкидокНаценокСрезПервых.СкидкаНаценка = ТаблицаСкидкиНаценки.Ссылка
	|ГДЕ
	|	    (НЕ ДействиеСкидокНаценокСрезПоследних.Период ЕСТЬ NULL
	|	ИЛИ НЕ ДействиеСкидокНаценокСрезПервых.Период ЕСТЬ NULL)
	|	И ЕСТЬNULL(ДействиеСкидокНаценокСрезПоследних.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыДействияСкидок.НеДействует)) = ЗНАЧЕНИЕ(Перечисление.СтатусыДействияСкидок.Действует)
	|");
	
	Запрос.УстановитьПараметр("ДатаСреза", Дата);
	Запрос.УстановитьПараметр("Источник", Источник);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ПроверитьОснованиеЗаказКлиенту(Массив)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ЗаказКлиента.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.СчетНаОплатуКлиенту КАК СчетНаОплатуКлиенту
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ЗаказКлиента
	|		ПО СчетНаОплатуКлиенту.ДокументОснование = ЗаказКлиента.Ссылка
	|ГДЕ
	|	СчетНаОплатуКлиенту.Ссылка В (&Массив)";
	
	Запрос.Параметры.Вставить("Массив", Массив);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ОснованияЗаказКлиента = Истина;
	
	Пока Выборка.Следующий() Цикл
		
		Если ТипЗнч(Выборка.Ссылка) <> Тип("ДокументСсылка.ЗаказКлиента") Или Выборка.Ссылка.Пустая() Тогда
			ОснованияЗаказКлиента = Ложь;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ОснованияЗаказКлиента;
	
КонецФункции

// <+БИТ> Руденков_Е.И. 30.03.2024 
// #000000222, Счет на оплату. 
&НаСервере
Функция ПолучитьСрокОплаты(ДатаСчета)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДанныеПроизводственногоКалендаря.ПроизводственныйКалендарь КАК ПроизводственныйКалендарь,
	|	ДанныеПроизводственногоКалендаря.Дата КАК Дата,
	|	ДанныеПроизводственногоКалендаря.Год КАК Год,
	|	ДанныеПроизводственногоКалендаря.ВидДня КАК ВидДня,
	|	ДанныеПроизводственногоКалендаря.ДатаПереноса КАК ДатаПереноса
	|ИЗ
	|	РегистрСведений.ДанныеПроизводственногоКалендаря КАК ДанныеПроизводственногоКалендаря
	|ГДЕ
	|	ДанныеПроизводственногоКалендаря.Дата МЕЖДУ &ПериодС И &ПериодПо
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата";
	
	Запрос.УстановитьПараметр("ПериодПо"	,НачалоДня(ДатаСчета) + 86400*60);
	Запрос.УстановитьПараметр("ПериодС"		,НачалоДня(ДатаСчета) + 86400);
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	ДобавленоДней = 0;
	текДата = ДатаСчета;
	Пока Выборка.Следующий() И ДобавленоДней <> 5 Цикл
		Если Выборка.ВидДня <> Перечисления.ВидыДнейПроизводственногоКалендаря.Рабочий Тогда
			Продолжить;
		КонецЕсли;
		текДата = Выборка.Дата;
		ДобавленоДней = ДобавленоДней + 1;
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат текДата;
	
КонецФункции // <-БИТ> Руденков_Е.И. 30.03.2024

&ИзменениеИКонтроль("СформироватьПечатнуюФормуСчетНаОплату")
Функция КАНАТ_СформироватьПечатнуюФормуСчетНаОплату1(СтруктураТипов, ОбъектыПечати, ПараметрыПечати)

	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СЧЕТНАОПЛАТУ";

	НомерТипаДокумента = 0;

	УстановитьПривилегированныйРежим(Истина);

	Для Каждого СтруктураОбъектов Из СтруктураТипов Цикл

		НомерТипаДокумента = НомерТипаДокумента + 1;
		Если НомерТипаДокумента > 1 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(СтруктураОбъектов.Ключ);
		ДанныеДляПечати = МенеджерОбъекта.ПолучитьДанныеДляПечатнойФормыСчетаНаОплату(ПараметрыПечати, СтруктураОбъектов.Значение);
        #Удаление
		ЗаполнитьТабличныйДокументСчетаНаОплату(ТабличныйДокумент, ДанныеДляПечати, ОбъектыПечати, ПараметрыПечати);
        #КонецУдаления
		#Вставка
		//·++·Гурьев·07.08.23·#2_11_4·Выбор иной процедуры, если ПФ заполняется из документа СчетНаОплатуКлиенту
		
		Если СтруктураОбъектов.Ключ = "Документ.СчетНаОплатуКлиенту" Тогда
			ПроверкаОснованиеЗаказКлиенту = ПроверитьОснованиеЗаказКлиенту(СтруктураОбъектов.Значение);
			Если ПроверкаОснованиеЗаказКлиенту Тогда
				ЗаполнитьТабличныйДокументСчетаНаОплату_СчетНаОплатуКлиенту(ТабличныйДокумент, ДанныеДляПечати, ОбъектыПечати, ПараметрыПечати);
			Иначе 
				ЗаполнитьТабличныйДокументСчетаНаОплату(ТабличныйДокумент, ДанныеДляПечати, ОбъектыПечати, ПараметрыПечати);
			КонецЕсли;
		Иначе
			ЗаполнитьТабличныйДокументСчетаНаОплату(ТабличныйДокумент, ДанныеДляПечати, ОбъектыПечати, ПараметрыПечати);
		КонецЕсли;
		//·--·Гурьев·07.08.23

		#КонецВставки
	КонецЦикла;

	УстановитьПривилегированныйРежим(Ложь);

	Возврат ТабличныйДокумент;

КонецФункции
